IDEA Open Model
NumberGroups.CreateGroups Method (IEnumerable<Double>)
Compatible with IDEA StatiCa Beta 20.0
 Creates new instance with groups with with one value in group.
 Namespace: IdeaRS.OpenModel.Parameters
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public static NumberGroups CreateGroups(
	IEnumerable<double> positions
)
Public Shared Function CreateGroups (
	positions As IEnumerable(Of Double)
) As NumberGroups
Parameters
positions
Type: System.Collections.Generic.IEnumerable<Double>
The sequence of numbers to create groups.
Return Value
Type: NumberGroups
A new instance of groups.
See Also
Reference
NumberGroups Class
CreateGroups Overload
IdeaRS.OpenModel.Parameters Namespace